cmsis-svd/cmsis-svd/data/Atmel/ATSAMD21E15A.svd
        <register>
          <name>FCTRLA</name>
          <description>Recoverable Fault A Configuration</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRC</name>
              <description>Fault A Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SRCSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Fault input disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>MCEx (x=0,1) event input</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>Inverted MCEx (x=0,1) event input</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTFAULT</name>
                  <description>Alternate fault (A or B) state at the end of the previous period</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEEP</name>
              <description>Fault A Keeper</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QUAL</name>
              <description>Fault A Qualification</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLANK</name>
              <description>Fault A Blanking Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BLANKSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No blanking applied</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Blanking applied from rising edge of the output waveform</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Blanking applied from falling edge of the output waveform</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Blanking applied from each toggle of the output waveform</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTART</name>
              <description>Fault A Restart</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALT</name>
              <description>Fault A Halt Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>HALTSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Halt action disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Hardware halt action</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Software halt action</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NR</name>
                  <description>Non-recoverable fault</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL</name>
              <description>Fault A Capture Channel</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CHSELSelect</name>
                <enumeratedValue>
                  <name>CC0</name>
                  <description>Capture value stored in channel 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Capture value stored in channel 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Capture value stored in channel 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC3</name>
                  <description>Capture value stored in channel 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTURE</name>
              <description>Fault A Capture Action</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CAPTURESelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No capture</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPT</name>
                  <description>Capture on fault</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMIN</name>
                  <description>Minimum capture</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMAX</name>
                  <description>Maximum capture</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMIN</name>
                  <description>Minimum local detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMAX</name>
                  <description>Maximum local detection</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DERIV0</name>
                  <description>Minimum and maximum local detection</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKVAL</name>
              <description>Fault A Blanking Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FILTERVAL</name>
              <description>Fault A Filter Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTRLB</name>
          <description>Recoverable Fault B Configuration</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRC</name>
              <description>Fault B Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SRCSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Fault input disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>MCEx (x=0,1) event input</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>Inverted MCEx (x=0,1) event input</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTFAULT</name>
                  <description>Alternate fault (A or B) state at the end of the previous period</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEEP</name>
              <description>Fault B Keeper</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QUAL</name>
              <description>Fault B Qualification</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLANK</name>
              <description>Fault B Blanking Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BLANKSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No blanking applied</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Blanking applied from rising edge of the output waveform</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Blanking applied from falling edge of the output waveform</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Blanking applied from each toggle of the output waveform</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTART</name>
              <description>Fault B Restart</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALT</name>
              <description>Fault B Halt Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>HALTSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Halt action disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Hardware halt action</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Software halt action</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NR</name>
                  <description>Non-recoverable fault</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL</name>
              <description>Fault B Capture Channel</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CHSELSelect</name>
                <enumeratedValue>
                  <name>CC0</name>
                  <description>Capture value stored in channel 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Capture value stored in channel 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Capture value stored in channel 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC3</name>
                  <description>Capture value stored in channel 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTURE</name>
              <description>Fault B Capture Action</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CAPTURESelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No capture</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPT</name>
                  <description>Capture on fault</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMIN</name>
                  <description>Minimum capture</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMAX</name>
                  <description>Maximum capture</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMIN</name>
                  <description>Minimum local detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMAX</name>
                  <description>Maximum local detection</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DERIV0</name>
                  <description>Minimum and maximum local detection</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKVAL</name>
              <description>Fault B Blanking Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FILTERVAL</name>
              <description>Fault B Filter Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WEXCTRL</name>
          <description>Waveform Extension Configuration</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OTMX</name>
              <description>Output Matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTIEN0</name>
              <description>Dead-time Insertion Generator 0 Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIEN1</name>
              <description>Dead-time Insertion Generator 1 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIEN2</name>
              <description>Dead-time Insertion Generator 2 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIEN3</name>
              <description>Dead-time Insertion Generator 3 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTLS</name>
              <description>Dead-time Low Side Outputs Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DTHS</name>
              <description>Dead-time High Side Outputs Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
